madden.gif?resize=500% [TRANSLATE THIS COMMENT]
Έπεηηα απφ ην έξγν  ηνπ Alan  Turing, παξαηεξήζεθε ε ελαζρφιεζε φιν θαη 
πεξηζζφηεξσλ  Δπηζηεκφλσλ  κε ηελ ΣΝ θαη ηηο εθαξκνγέο ηεο. Με ηελ πάξνδν ηνπ 
ρξφλνπ αθνινχζεζε κεγάιν ελδηαθέξνλ, ην νπνίν αθφκε θαη ζηηο κέξεο καο δελ έρεη 
εθιείςεη, θαζψο νη δπλαηφηεηεο ηεο  ΣΝ αλαπηχζζ νληαη εθζεηηθά, ζε αλαινγία κε ηελ 
πξφνδν ηεο Δπηζηήκε ο ησλ Τπνινγηζηψλ θαη ηηο δπλαηφηεηεο ησλ ππνινγηζηηθψλ 
κέζσλ θαη πξνγξακκάησλ . Αθνινπζεί ζρεηηθφο Πίλαθαο κε ηηο θάζεηο - νξφζεκα ηεο 
ΣΝ (Πίλαθαο 1).  
7 
 1943  Οη McCulloch θαη Pitts πξνηείλνπλ έλα κνληέιν ηερλεηψλ λεπξψλσλ πνπ έρεη ηε 
δπλαηφηεηα λα καζαίλεη θαη λα ππνινγίδεη θάζε ππνινγίζηκε ζπλάξηεζε.  
1950  Ο AlanTuring, πνπ ζεσξείηαη ν παηέξαο ηεο ΣΝ, εκπλέεηαη ην ηεζη ηεο κίκεζεο (ηεζη 
Σνχξηλγθ) γηα ηελ αλαγλψξηζε επθπψλ κεραλψλ.  
1951  Οη Minsky θαη Edmonts πινπνηνχλ ην πξψην λεπξσληθφ δίθηπν, ην SNARC 
(Stochastic  Neural  Analog  Reinforcement  Calculator), ην νπνίν έρεη 40 λεπξψλεο θαη 
ρξεζηκνπνηεί 3000 ιπρλίεο.  
1956  ΢πλάληεζε ζην Dartmouth  College εξεπλεη ψλ απφ ην ρψξν ησλ Μαζεκαηηθψλ, ηεο 
Ηιεθηξνληθήο θαη Φπρνινγίαο (McCarthy, AllenNewell, Herbert  Simon, Marvin  
Minsky) κε θνηλφ ζηφρν ηε κειέηε δπλαηνηήησλ ρξήζεο ησλ ππνινγηζηψλ γηα ηελ 
πξνζνκνίσζε ηεο αλζξψπηλεο λνεκνζχλεο.  
1958  Γεκηνπξγία ηεο γιψζζαο L isp απφ ηνλ McCarthy.  
1966  Μεηά απφ έξεπλα γχξσ απφ ηελ θαηαλφεζε γιψζζαο θαη ηελ αληίιεςε κεραλήο, ν 
Weizenbaum δεκηνπξγεί ην ELIZA.  
1977  Γεκηνπξγία ησλ πξψησλ εκπείξσλ ζπζηεκάησλ: DENDRAL (1971), MYCIN (1975), 
Prospector (1977).  
1972  α. Οη Colmerauer θαη Roussel απφ ην Παλεπηζηήκην ηεο Μαζζαιίαο ζε ζπλεξγαζία κε 
ηνλ R. Kowalski απφ ην Παλεπηζηήκην ηνπ Δδηκβνχξγνπ θαηαιήγνπλ ζηε δεκηνπξγία 
ηεο γιψζζαο ινγηθνχ πξνγξακκαηηζκνχ PROLOG.  β. Ο Winograd εκβαζχλεη ζηελ 
θαηαλφεζε θπζηθήο γιψζζαο.  
1975 
&1977  Ο M. Minsky δεκνζηεχεη θεθάιαηα πεξί αλαπαξάζηαζεο ηεο γλψζεο ζε βηβιία.  
1976  Οη Newell  & Simon ππνζηεξίδνπλ ηελ ππφζεζε φηη έλα θπζηθφ ζπκβνιηθφ ζχζηεκα 
δηαζέηεη ηα απαξαίηεηα ραξαθηεξηζηηθά γηα λνήκνλεο ελέξγεηεο.  
1970 - Αλάπηπμε εμειηθηηθψλ αιγ φξηζκσλ.  
Δθδίδνληαη βηβιία κε κειέηεο:  
1973  ηνπ Rechenberg γηα ηε βειηηζηνπνίεζε ησλ ηερληθψλ ζπζηεκάησλ θαη ηηο αξρέο ηεο 
βηνινγηθήο εμέιημεο.  
1975  ηνπ Holland γηα ηελ πξνζαξκνζηηθφηεηα ζηα θπζηθά θαη ηερλεηά ζπζηήκαηα.  
1992  ηνπ Koza, γηα ην Γελεηηθφ Πξνγξακκαηηζκφ (Genetic  Programming).  
1995  ηνπ Fogel γηα ηνλ Δμειηθηηθφ Τπνινγηζκφ (Evolutionary  Computation).  
1980 -90  Αλαγέλλεζε ησλ Σερλεηψλ Νεπξσληθψλ Γηθηχσλ.  
1986  Οη Rumelhart and McClelland πεξηγξάθνπλ ηε δεκηνπξγία πξνζνκνηψζεσλ ηεο 
αληίιεςεο ζηνλ ππνινγηζηή.  
1987  1ν Γηεζλέο  ΢πλέδξην  γηα ηα Νεπξσληθά  Γίθηπα  ηνπ IEEE (Institute of Electrical and 
Electronics Engineers).  
1965 
&1968  Πξψηνο ν Zadeh εηζάγεη ηνπο φξνπο «Αζαθή ΢χλνια» (Fuzzy  Sets, 1965) θαη 
«Αζαθείο Αιγφξηζκνη» (Fuzzy  Algorithms, 1968).  
1983  Ο Sugeno δηαηππψλεη ηελ «Αζαθή Θεσξία».  
1992  1ν ΢πλέδξην ηνπ ΙΔΔΔ γηα ηα Αζαθή ΢χλνια.  
1990 - Γεκηνπξγία α. ππνινγηζηηθψλ ζπζηεκάησλ θαη κεραλψλ πνπ βαζίδνληαη ζε αξρέο ηεο 
ΣΝ θαη ηα νπνία παξνπζηάδνπλ ηάζεηο πξνζαξκνγήο ζην πεξηβάιινλ ηνπο (π.ρ. 
ξνκπφη) θαη β. εθαξκνγψλ πνπ ηείλνπλ λα «καζαίλνπλ» απφ ηελ εκπεηξία ηνπο: 
Ννήκνλεο πξάθηνξεο, Μεραλέο Αλαδήηεζεο ζη ν δηαδίθηπν, Πεξηξξένπζα Ννεκνζχλε.  
Πίνακασ 1: Οι Ημερομηνίεσ - Ορόςημα τησ ΤΝ.  
Πηγή: http://repfiles.kallipos.gr/html_books/93/00e -introduction.html  
8 
 1.1.3 ΜΔΛΛΟΝΣΙΚΔ΢ ΠΡΟΒΛΔΦΔΙ΢ ΚΑΙ ΚΙΝΓΤΝΟΙ  
Ήδε ζηηο κέξεο καο ε Σερλεηή Ννεκνζχλε εθαξκφδεηαη θαηά θφξσλ ζε πνιινχο 
ηνκείο. Μεξηθνί απφ απηνχο είλαη ε Οηθνλνκία, ηα Μαζεκαηηθά, ε Αζηξνλνκία, ε 
΢ηαηηζηηθή, ε Ιαηξηθή θαη ηα ΢πζηήκαηα Τγείαο,  ελψ επίζεο κπνξεί λα γίλεη ρξήζε 
ηεο απφ νπνηαδήπνηε επηρείξεζε ή νξγαληζκφ (απφ απηνθηλεηηθέο εηαηξείεο, κέρξη θαη 
ζε γεσπνληθέο κειέηεο). Η θχζεο ηεο ηελ θαζηζηά εθαξκφζηκε ζρεδφλ ζε θάζε πεδίν 
πνπ κπνξνχκε λα θαληαζηνχκε, φπσο ι.ρ. ην ρψξν ησλ Σερλψλ. Πξνδηαγξάθεηαη 
ινηπφλ έλα λέν κέιινλ, δηαθνξεηηθφ απφ απηφ ησλ πεξαζκέλσλ αηψλσλ, γεγνλφο πνπ 
εγείξεη ηφζν εξσηήκαηα, φζν θαη αλεζπρίεο.  
Σν ζέκα πνπ ηίζεηαη ζπλεζέζηεξα γχξσ απφ ηελ ΣΝ, είλαη ην εζηθφ πιαίζην ηεο 
πξνζαξκνγήο ηεο, ηα «φξηα» δειαδή πνπ ηίζεληαη θαηά ηελ ελαξκφληζ ή ηεο κε ηελ 
αλζξψπηλε θχζε θαη ηνπο θηλδχλνπο γχξσ απφ ηελ αλεμαξηεζία πνπ επηδεηθλχνπλ νη 
ππνινγηζηηθέο κεραλέο πνπ βαζίδνληαη ζε απηήλ.  
Πνιινί θάλνπλ ιφγν γηα ηνλ θψδηθα εζηθήο πνπ ζα πξέπεη λα εθαξκφδεηαη ζηελ 
εθάζηνηε εθαξκνγή, φπσο π .ρ. θαηά ηε δεκην πξγία ελφο ξνκπφη κε ινγηθή θξίζε. 
Άιινη είλαη ππνζηεξηθηέο ηεο ηδέαο πεξί ηνπ θηλδχλνπ «θαηαπάηεζεο» ηνπ θψδηθα 
απηνχ, βαζηζκέλνη ζην φηη έλα ξνκπφη πνπ ζθέθηεηαη, ζρεδφλ φπσο ν άλζξσπνο, 
κπνξεί λα αλαπηχμεη ηε δηθή ηνπ εζηθή, είηε απηή είλαη ζσζηή , είηε ιαλζαζκέλε.  
Σέινο, αλεζπρία πξνθαιεί ην ελδερφκελν ηεο επί ζθνπνχ ιαλζαζκέλεο ρξήζεο 
ινγηζκηθψλ ΣΝ, απνζθνπψληαο ζε πξνζσπηθά νθέιε, φπσο γηα παξάδεηγκα ε 
παξαπιεξνθφξεζε θαη θνηλσληθή ρεηξαγψγεζε, ε θαηαπάηεζε ησλ πξνζσπηθψλ 
δεδνκέλσλ, ε εμάπισζε ηνπ hack ing, θ.ά. . 
Κξίζηκν είλαη ινηπφλ, λα δεκηνπξγείηαη έλα ζχζηεκα απζηεξνχ ειέγρνπ θαη λα 
εθαξκφδεηαη απαξαηηήησο έλα πξνζαξκνζκέλν λνκηθφ πιαίζην, ζηελ εθάζηνηε 
εθαξκνγή, βαζηζκέλε ζηελ ΣΝ.  
Να πξνζηεζεί φκσο, φηη κειινληηθέο πξνβιέςεηο  ζέινπλ ηελ ΣΝ λα αθκάδε η θαηά 
ηηο επφκελεο δεθαεηίεο, θπξίσο ζε ζπλδπαζκφ κε ηνπο θβαληηθνχο ππνινγηζηέο, νη 
νπνίνη αλέηξεςαλ άξδελ ηα κέρξη ηψξα δεδνκέλα γχξσ απφ ηηο δπλαηφηεηεο ησλ 
ππνινγηζηηθψλ κεραλψλ. Ο ζπλδπαζκφο απηψλ ησλ πνιιά ππνζρφκελσλ 
«εξγαιείσλ», πηζηεχεηαη φηη ζα αιιάμεη ηνλ θφζκν  πνπ κέρξη ηψξα γλσξίδνπκε. Καη 
θπζηθά, φπσο ζε θάζε ηέηνηα αλαηξνπή, έηζη θαη ζε απηήλ ηελ πεξίπησζε, νη  απφςεηο 
ηείλνπλ λα δηίζηαληαη.  
9 
 1.2 ΟΡΑ΢Η ΤΠΟΛΟΓΙ΢ΣΧΝ (COMPUTER VISION)  
 

https://www.barcodesinc.com/news/new -barcode -workflows -for-nurses/  
25 
  
Σα ηειεπηαία ρξφληα φκσο, ε ρξήζε ηνπ θψδηθα QR έθηαζε θαη ζην ρψξν ηεο 
Φσηνγξακκεηξίαο, θαζψο ρξεζηκνπνηείηα η πιένλ γηα ηελ απηφκαηε αλαδήηεζε θαη 
ηαρεία απνθσδηθνπνίεζε ησλ πξνζεκαζκέλσλ ζεκείσλ ζην ρψξν, κέζσ ηεο ιήςεο 
θσηνγξαθηψλ. ΢πγθεθξηκέλα, γίλεηαη ρξήζε εηδηθψλ θσδηθνπνηεκέλσλ ζηφρσλ, 
ζπλήζσο ζηξφγγπιεο ή ηεηξάγσλεο κνξθήο , νη νπνίνη ηνπνζεηνχληαη ζπλήζσ ο γχξσ 
απφ ην αληηθείκελν πνπ δεηείηαη λα απνηππσζεί.  
Ο εληνπηζκφο ησλ ζηφρσλ απηψλ πξνθχπηεη απφ απηνκαηνπνηεκέλεο δηαδηθαζίεο, 
απνθεχγνληαο έηζη ηνλ θίλδπλν ρνλδξνεηδψλ ζθαικάησλ  θαη ηηο ρξνλνβφξεο 
εξγαζίεο . Απηφο είλαη θαη ν ιφγνο πνπ θαζίζηαηαη ρξήζηκε  ε ζπγθεθξηκέλε κέζνδνο 
ζην πεδίν ηεο Φσηνγξακκεηξίαο, θαζψο κπνξεί λα παξαρζεί εχθνια θαη γξήγνξα ε 
δεηνχκελε πιεξνθνξία αλά εθαξκνγή (π.ρ. ηξηζδηάζηαηε απεηθφληζε θηηζκάησλ). 
Γίλεηαη ινηπφλ,  ε δπλαηφηεηα ηνπ απηφκαηνπ εληνπηζκνχ , ηεο αλαγλψξηζε ο θαη ηεο 
κέηξεζε ο ησλ ζηφρσλ ,  πνπ ζεκαηνδνηνχλ ηα ζεκεία ελδηαθέξνληνο.  
 

Πηγή: https://www.agisoft.com/pdf/PS_1.1_Tutorial% [TRANSLATE THIS COMMENT]
% [TRANSLATE THIS COMMENT]
 
Καηά ην αληίζηνηρν εγρεηξίδην ηεο Agisoft, ν ζσζηφο ηξφπνο ηνπνζέηεζεο ησλ 
ζηφρσλ είλαη ν εμήο, φπσο θαίλεηαη ζηηο Δηθφλα 10.  
 
 
Εικόνα 10: Μεθοδολογία τοποθζτηςησ των ςτόχων  
Πηγή: https://www.agisoft.com/pdf/PS_1.1_Tutorial% [TRANSLATE THIS COMMENT]
% [TRANSLATE THIS COMMENT]
 

SungJoonAhn, W. R. (1999). Circular Coded Landmark for Optical 3D -Measurement and 
Robot Vision.   
Szeliski, R. (2022). Computer Vision:Algorithms and Applications.   
Vladimir A. Knyaz, A. V. (1998). on Contact 3D Mode l Reconstruction Using Coded Targets. 
Moscow, Russia.  
wikipedia . (n.d.). Ανάκτηςη  από 
https://el.wikipedia.org/wiki/% [TRANSLATE THIS COMMENT]
R 
wikipedia . (n.d.). Ανάκτηςη από 
https://el.wikipedia.org/wiki/% [TRANSLATE THIS COMMENT]
CE% [TRANSLATE THIS COMMENT]
50 
 Wikipedia . (n.d.). Ανάκτηςη από https://en.wikipedia.org/wiki/Dartmouth_workshop  
Winston, P. H. (1976). Artificial Intelligence.   
Βαρυτιμίδη σ, Χ. Ι. (2008). Ανίχνευςη αντικειμζνων και ημιαυτόματοσ.  
Βίκτωρ, Μ. (2021). Ανάκτηςη από 
https://polynoe.lib.uniwa.gr/xmlui/bitstream/handle/11400/364/ntst44.pdf?sequence=1&is
Allowed=y  
ΓΕΩΡΓΙΟΤ, Χ. Ι. (2014). Αναγνώριςη ταυτότητασ προςώπου από βιντεοςκοπή ςεισ.  
ΓΕΩΡΓΟΤΛΗ, Κ. (n.d.). Ανάκτηςη από http://repfiles.kallipos.gr/html_books/93/00e -
introduction.html  
Κατερίνα, Γ. (n.d.). Ανάκτηςη από http://repfiles.kallipos.gr/html_books/93/00e -
introduction.html  
 

for i=1:size(labels9,1)  
    row = cell2mat(labels9{i,2:end}');  
    targetBBs {i,1} = row; 
end 
 
% [TRANSLATE THIS COMMENT]
% [TRANSLATE THIS COMMENT]
% [TRANSLATE THIS COMMENT]
labels9 = table(fileNames,targetBBs,'VariableNames',{'imageFilenames','targets'});  
 
% [TRANSLATE THIS COMMENT]
save('labels_oneTarget9.mat','labels9')  
 

for i=1:rows  
    bb=bbox(i,:);  
    x=bb(1);  
    y=bb(2);  
    w=bb(3);  
    h=bb(4);  
Ic=img(y:y+h,x:x+w,:);  
 
% [TRANSLATE THIS COMMENT]
    r=round((min(w,h))/2);  
    [centers,radii,metric]= 
imfindcircles(Ic,[floor(r/2),r], 'ObjectPolarity' ,'dark' ,'Sensitivity' ,0.99);  
 

for theta=(15: -0.5:-15) 
% [TRANSLATE THIS COMMENT]
% [TRANSLATE THIS COMMENT]
% [TRANSLATE THIS COMMENT]
% [TRANSLATE THIS COMMENT]
        B=imrotate(Ic2,theta);  
        s=size(B);  
        N=imresize (Ic,s); 
% [TRANSLATE THIS COMMENT]
corr=corr2(B,N);  
if corr>max_corr(i)  
max_theta(i)=theta;  
end 
max_corr(i)=max(max_corr(i),corr);  
end 
% [TRANSLATE THIS COMMENT]
    subplot(1,rows,i)  
    imshow(N)  
    title(num2str(max_corr(i)))  
end  
55 
 ΠΑΡΑΡΣΗΜΑΒ: ΔΙΚΟΝΔ΢ ΔΚΠΑΙΓΔΤ΢Η΢ ΑΛΓΟΡΙΘΜΟΤ  
Θεηηθέο Δηθόλεο:  
 